#Задача 1
s = ';пушок_серый_обычный_рыба;шарик_белый_тагильский_косточка;'
s1 = s.replace('_', ' ')
i = s.find(';')
i2 = s.find(';', i + 1)
i3 = s.find(';', i2 + 1)
a = s1[i+1:i2]
b = s1[i2+1:i3]
print(a,b)







































#Задача 2
s = ''
s2 = s.replace('_',' ')
s3 = s2.title()
#print(s3)
 #Задача 3
s = '`*1%банан%10%cвежие*2%яблоко%5%полежавшие*'
s2 = s.replace('*','')
s3 = s2.replace('`','')
s4 = s3.replace('%','')
s5 = s4.replace('1',' ')
s6 = s5.replace('0','')
s7 = s6.replace('2',' ')
s8 = s7.replace('5',' ')
s44 = s8.title()
print(s44)
 #Задача 4
s = '`@морозко:150:фисташковый:эскимо@коровка:220:клубничная: стаканчик@'
s2 = s.replace('@',' ')
s3 = s2.replace('`','')
s4 = s3.replace(':',' ')
s5 = s4.replace('1',' ')
s6 = s5.replace('0','')
s7 = s6.replace('5',' ')
s8 = s7.replace('2',' ')
s44 = s8.title()
print(s44)
#Задача 5
s = '`#сияние(стивенкинг(1000(ужасы#капитанскаяДочка(Пушкин(220(Роман#`'
s2 = s.replace('#',' ')
s3 = s2.replace('`','')
s4 = s3.replace('(',' ')
s5 = s4.replace('1','')
s6 = s5.replace('0','')
s7 = s6.replace('2','')
s8 = s7.replace('Д',' Д')
s44 = s8.title()
print(s44)
#Задача 4
s = '`&сосна№сосновое№150№90дуб№дерево№50№200№'
