# animals = {
#     ' жираф': ['да','нет','да'],
#     'собака': ['нет','да','нет'],
#     'тигр': ['да','нет','да'],
# }
# questions = {
#     'вопрос 1': {
#         'да': 'вопрос 2',
#         'нет': 'вопрос 3'
#     }
# }
# answer = []
# current_question = 'вопрос 1'
# while True:
#     if len(answer) != 0:
#         for animal in animals:
#             # Проверяем нашлось ли животное
#     answer = input(current_question )
#     answers.append(answer)
#     current_question = questions

# animals = {  'кошка': {
#     'country': 'Япония',
#     'fuel': 'Гибрид',
#     'body_type': 'Седан',
#     'drive': 'Передний',
#     'transmission': 'Автомат'
# }
# }


animals = {
    'кошка': ['да','нет','да'],
    'Тукан': ['нет','да','нет'],
    'Панда': ['да','нет','да'],
    'Утка': ['да', 'нет', 'да'],
    'Лошадь': ['да', 'нет', 'да'],
    'коза': ['да', 'нет', 'да'],
    'крокодил': ['да', 'нет', 'да'],
    'слон': ['да', 'нет', 'да'],
    'Петух': ['да', 'нет', 'да'],
    'курица': ['да', 'нет', 'да'],
    'собака': ['да', 'нет', 'да'],
    'лев': ['да', 'нет', 'да'],
    'индюк': ['да', 'нет', 'да'],
    'свинья': ['да', 'нет', 'да'],
    'енот': ['да', 'нет', 'да'],
    'волк': ['да', 'нет', 'да'],
    'дятел': ['да', 'нет', 'да'],
    'белый медведь': ['да', 'нет', 'да'],
    'бобер': ['да', 'нет', 'да'],
    'лось': ['да', 'нет', 'да'],
    'пингвин': ['да', 'нет', 'да'],
    'сова': ['да', 'нет', 'да'],
    'павлин': ['да', 'нет', 'да'],
    'ленивец': ['да', 'нет', 'да'],
    'дельфин': ['да', 'нет', 'да'],
    'лиса': ['да', 'нет', 'да'],
    'ёж': ['да', 'нет', 'да'],
    'черепаха': ['да', 'нет', 'да'],
    'кабан': ['да', 'нет', 'да'],
    'попугай': ['да', 'нет', 'да'],
    'медведь': ['да', 'нет', 'да'],
    'осел': ['да', 'нет', 'да'],
    'белка': ['да', 'нет', 'да'],
    'фламинго': ['да', 'нет', 'да'],
    'тигр': ['да', 'нет', 'да'],
    'кит': ['да', 'нет', 'да'],
    'мартышка': ['да', 'нет', 'да'],
    'зебра': ['да', 'нет', 'да'],
    'заяц': ['да', 'нет', 'да'],
    'жираф': ['да', 'нет', 'да'],
    'баран': ['да', 'нет', 'да'],
    'корова': ['да', 'нет', 'да'],
}

questions = {
    'Это птица?': {
         'да': 'эта птица живет на ферме?',
            'да': 'Эта птица несет яйца?',
            'нет': 'Эта птица живет в лесу?'
         'нет': 'Это животное живет на ферме?'
     }
 }







































}